smash> my_sleep
random1.txt
random2.txt
sub1
sub2
sub3
smash> dynamic cast not null
smash> test_redirect
smash> dynamic cast not null
smash> again_redirect
smash> dynamic cast not null
smash> again_redirect
test_redirect
smash> dynamic cast null
smash pid is 16802
smash> smash> dynamic cast null
smash pid is 16802
smash> smash> dynamic cast null
smash pid is 16802
smash> smash> my_sleep
mypid
new
random1.txt
random2.txt
sub1
sub2
sub3
smash> smash> dynamic cast null
smash> [1] sleep 100& : 16825 0 secs
smash> dynamic cast null
smash error: kill: invalid arguments
smash> smash> dynamic cast null
smash error: kill: invalid arguments
smash> smash> k
my_sleep
mypid
new
random1.txt
random2.txt
s
sub1
sub2
sub3
t
smash> dynamic cast not null
smash> k
my_sleep
mypid
new
p
random1.txt
random2.txt
s
sub1
sub2
sub3
t
smash> k
my_sleep
mypid
new
p
random1.txt
random2.txt
s
sub1
sub2
sub3
t
smash> smash error: open failed: No such file or directory
smash> smash error: open failed: No such file or directory
smash> before
smash> again_redirect
test_redirect
smash> smash> smash error: open failed: Permission denied
smash> smash> k
my_sleep
mypid
p
random1.txt
random2.txt
s
sub1
sub2
sub3
t
smash> dynamic cast not null
smash> k
my_sleep
mypid
new
p
random1.txt
random2.txt
s
sub1
sub2
sub3
t
smash> k
my_sleep
mypid
new
p
random1.txt
random2.txt
s
sub1
sub2
sub3
t
smash> smash> dynamic cast not null
smash> k
my_sleep
mypid
new
p
random1.txt
random2.txt
s
sub1
sub2
sub3
t
smash> k
my_sleep
mypid
new
p
random1.txt
random2.txt
s
sub1
sub2
sub3
t
smash> smash> dynamic cast not null
smash> k
my_sleep
mypid
new
p
random1.txt
random2.txt
s
sub1
sub2
sub3
t
smash> smash> dynamic cast not null
smash> k
my_sleep
mypid
new
p
random1.txt
random2.txt
s
sub1
sub2
sub3
t
test
smash> dynamic cast not null
smash> 0
2
4
Done: 6
smash> smash: sending SIGKILL signal to 1 jobs:
16825: sleep 100&
